app/controllers/events_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."event_id" = ? AND (start_date >= '2020-06-19' OR end_date >= '2020-06-19')  [["event_id", 3]]
---
    def preload
        today = Date.today
        reservations = @event.reservations.where("start_date >= ? OR end_date >= ?", today, today)