app/controllers/guest_reviews_controller.rb

    def create
        # Step 1: Check if the reservation exist (event_id, host_id, host_id)

        # Step 2: Check if the current host already reviewed the guest in this reservation.

        @reservation = Reservation.where(
            id: guest_review_params[:reservation_id],
            event_id: guest_review_params[:event_id]
        ).first

        if !@reservation.nil? && @reservation.event.user.id == guest_review_params[:host_id].to_i

            @has_reviewed = GuestReview.where(
                reservation_id: @reservation.id,
                host_id: guest_review_params[:host_id]
            ).first

            if @has_reviewed.nil?
                # Allow to review
                @guest_review = current_user.guest_reviews.create(guest_review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."type" IN ('GuestReview') AND "reviews"."reservation_id" = ? AND "reviews"."host_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["reservation_id", 3], ["host_id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "star", "room_id", "reservation_id", "guest_id", "host_id", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        @guest_review = Review.find(params[:id])
        @guest_review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."type" IN ('GuestReview') AND "reviews"."id" = ?  [["id", 1]]