app/controllers/host_reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."type" IN ('HostReview') AND "reviews"."reservation_id" = ? AND "reviews"."guest_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["reservation_id", 5], ["guest_id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "star", "room_id", "reservation_id", "guest_id", "host_id", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # Step 1: Check if the reservation exist (event_id, guest_id, host_id)

    # Step 2: Check if the current host already reviewed the guest in this reservation.

    @reservation = Reservation.where(
                    id: host_review_params[:reservation_id],
                    event_id: host_review_params[:event_id],
                    user_id: host_review_params[:guest_id]
                   ).first

    if !@reservation.nil?

      @has_reviewed = HostReview.where(
                        reservation_id: @reservation.id,
                        guest_id: host_review_params[:guest_id]
                      ).first

      if @has_reviewed.nil?
          # Allow to review
          @host_review = current_user.host_reviews.create(host_review_params)