app/controllers/pages_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."active" = ? LIMIT ?  [["active", "t"], ["LIMIT", 3]]
---
    def home
        @events = Event.where(active: true).limit(3)

SELECT "events".* FROM "events" WHERE "events"."active" = ?  [["active", "t"]]
---
    def search
        # STEP 1
        if params[:search].present? && params[:search].strip != ""
            session[:loc_search] = params[:search]
        end

        # STEP 2
        if session[:loc_search] && session[:loc_search] != ""
            @events_address = Event.where(active: true).near(session[:loc_search], 5, order: 'distance')