app/controllers/photos_controller.rb

INSERT INTO "photos" ("room_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.find(params[:event_id])

    if params[:images]
      params[:images].each do |img|
        @event.photos.create(image: img)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 3]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @event = @photo.event

    @photo.destroy