app/controllers/reservations_controller.rb

    def create
        event = Event.find(params[:event_id])

        if current_user == event.user
            flash[:alert] = "You cannot book your own property!"
        else
            start_date = Date.parse(reservation_params[:start_date])
            end_date = Date.parse(reservation_params[:end_date])
            days = (end_date - start_date).to_i + 1

            @reservation = current_user.reservations.build(reservation_params)
            @reservation.event = event
            @reservation.price = event.price
            @reservation.total = event.price * days
            @reservation.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "event_id", "start_date", "end_date", "price", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def your_trips
        @trips = current_user.reservations.order(start_date: :asc)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? ORDER BY "reservations"."start_date" ASC  [["user_id", 3]]