app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."type" = ? AND "reviews"."guest_id" = ? ORDER BY "reviews"."id" DESC  [["type", "HostReview"], ["guest_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @events = @user.events

    # Display all the guest reviews to host (if this user is a host)
    @guest_reviews = Review.where(type: "GuestReview", host_id: @user.id)